Revit 2027 API
OptionalFunctionalityUtils.IsDWGImportLinkAvailable Method
 Checks whether the DWG Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDWGImportLinkAvailable()
Public Shared Function IsDWGImportLinkAvailable As Boolean
public:
static bool IsDWGImportLinkAvailable()
static member IsDWGImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the DWG Import/Link functionality is available in the installed Revit.
Remarks
 DWG Import/Link is optional functionality that does not have to be part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace